pokemon-tinder-backend/app/controllers/pokemons_controller.rb

INSERT INTO "pokemons" ("age", "enjoys", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["age", 4], ["enjoys", "Meow Mix, and plenty of sunshine."], ["created_at", "2019-04-04 18:36:40.093955"], ["updated_at", "2019-04-04 18:36:40.093955"]]
---
  def create
    # Create a new Pokemon
    pokemon = Pokemon.create(pokemon_params)