pokemon-tinder-backend/app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def index
    pokemons = Pokemon.all

INSERT INTO "pokemons" ("name", "age", "enjoys", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Pikachu"], ["age", 1], ["enjoys", ""], ["created_at", "2019-04-05 22:36:53.532325"], ["updated_at", "2019-04-05 22:36:53.532325"]]
SELECT "pokemons".* FROM "pokemons"
---
  def create
    # Create a new Pokemon
    pokemon = Pokemon.create(pokemon_params)
    if pokemon.valid?
    render json: Pokemon.all

DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 1]]
SELECT "pokemons".* FROM "pokemons"
---
   def destroy
   pokemon = Pokemon.destroy(params[:id])
    render json: Pokemon.all